# CLI tools
brew "git"
brew "git-delta"
brew "lazygit"
brew "neovim"
brew "starship"
brew "tmux"
brew "topgrade"
brew "z"
brew "zsh"
brew "tree"
brew "jq"
brew "htop"
brew "httpie"
brew "node"
brew "rustup"

# Applications
cask "iterm2"
cask "raycast"
cask "rectangle"
cask "visual-studio-code"
cask "devtoys"

# Optional but useful dev tools
brew "ripgrep"
brew "fd"
brew "fzf"
